In [40]:
import pandas as pd

In [41]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [43]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [44]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [45]:
df.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

In [46]:
data = {'country': ['Korea', 'Japan', 'China', 'USA'],
        'capital': ['Seoul', 'Tokyo', 'Beijing', 'Washington'],
        'population': [5180, 12718, 141500, 32676]}
df_data = pd.DataFrame(data)
df_data

  country     capital  population
0   Korea       Seoul        5180
1   Japan       Tokyo       12718
2   China     Beijing      141500
3     USA  Washington       32676

In [47]:
age = df['Age'] # get column Age - Series (a single column or a single row)

In [48]:
#df = df.set_index('Name')

In [49]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [50]:
 df.describe() # get summary statistics

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [52]:
df[['Age','Fare']][:5] # get columns Age and Fare - DataFrame (multiple columns or multiple rows)

    Age     Fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [53]:
#loc and iloc
df.iloc[0] # get the first row

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [54]:
df.iloc[0:3] # get the first three rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [56]:
df.iloc[0:3, 1:4] # get the first three rows and the second, third and fourth columns

   Survived  Pclass                                               Name
0         0       3                            Braund, Mr. Owen Harris
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina

In [58]:
kyle1 = pd.DataFrame({'key': ['A', 'A', 'B', 'B', 'C', 'C'],
                        'data': [0,5,10,5,15,10]})
kyle1

  key  data
0   A     0
1   A     5
2   B    10
3   B     5
4   C    15
5   C    10

In [59]:
#groupby
kyle1.groupby('key').sum()

     data
key
A       5
B      15
C      25

In [62]:
import numpy as np
kyle1.groupby('key').aggregate(np.mean)

     data
key
A     2.5
B     7.5
C    12.5

In [63]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [64]:
df.groupby('Sex')['Age'].mean() # get the mean of age group by sex

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [65]:
df.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [68]:
kk1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=['A','B','C'],index=['a','b','c'])
kk1

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [69]:
kk1.sum(axis=1) # sum of each row

a     6
b    15
c    24
dtype: int64

In [70]:
kk1.sum(axis=0)

A    12
B    15
C    18
dtype: int64

In [71]:
kk1.mean()

A    4.0
B    5.0
C    6.0
dtype: float64

In [72]:
df.cov()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,66231.000000,-0.626966,-7.561798,138.696504,-16.325843,-0.342697,161.883369
Survived,-0.626966,0.236772,-0.137703,-0.551296,-0.018954,0.032017,6.221787
Pclass,-7.561798,-0.137703,0.699015,-4.496004,0.076599,0.012429,-22.830196
Age,138.696504,-0.551296,-4.496004,211.019125,-4.163334,-2.344191,73.849030
SibSp,-16.325843,-0.018954,0.076599,-4.163334,1.216043,0.368739,8.748734
Parch,-0.342697,0.032017,0.012429,-2.344191,0.368739,0.649728,8.661052
Fare,161.883369,6.221787,-22.830196,73.849030,8.748734,8.661052,2469.436846

In [73]:
df.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [75]:
df['Age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

In [79]:
#merge
kk8 = pd.DataFrame({'A': [1,2,3], 'B': [4,5,6], 'Key': ['K0', 'K1', 'K2']})
kk9 = pd.DataFrame({'C': [7,8,9], 'D': [10,11,12], 'Key': ['K0', 'K1', 'K2']})

In [80]:
pd.merge(kk8, kk9, on='Key')

   A  B Key  C   D
0  1  4  K0  7  10
1  2  5  K1  8  11
2  3  6  K2  9  12

In [81]:
pd.merge(kk8, kk9, on='Key', how='outer', indicator=True)

   A  B Key  C   D _merge
0  1  4  K0  7  10   both
1  2  5  K1  8  11   both
2  3  6  K2  9  12   both

In [82]:
pd.get_option('display.max_rows')

60

In [83]:
pd.Series(index=range(0,100))

c:\Users\User\anaconda3\envs\default\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
      ..
95   NaN
96   NaN
97   NaN
98   NaN
99   NaN
Length: 100, dtype: float64

In [84]:
pd.set_option('display.max_rows', 100)

In [85]:
kk10 = pd.DataFrame({'Amount': [100, 200, 300, 400, 500, 600, 700, 800, 900, 1000],
                    'Category': ['A', 'A', 'A', 'A', 'B', 'B', 'B', 'B', 'C', 'C'],
                    'Month': ['Jan','Feb','Mar','Apr','Jan','Feb','Mar','Apr','Jan','Feb']})

In [86]:
kk10

   Amount Category Month
0     100        A   Jan
1     200        A   Feb
2     300        A   Mar
3     400        A   Apr
4     500        B   Jan
5     600        B   Feb
6     700        B   Mar
7     800        B   Apr
8     900        C   Jan
9    1000        C   Feb

In [89]:
example_pivot = kk10.pivot(index="Category", columns="Month", values="Amount")
example_pivot

Month       Apr     Feb    Jan    Mar
Category
A         400.0   200.0  100.0  300.0
B         800.0   600.0  500.0  700.0
C           NaN  1000.0  900.0    NaN

In [90]:
example_pivot.sum()

Month
Apr    1200.0
Feb    1800.0
Jan    1500.0
Mar    1000.0
dtype: float64

In [91]:
example_pivot.sum(axis=1)

Category
A    1000.0
B    2600.0
C    1900.0
dtype: float64

In [95]:
df_pivot=df.pivot_table(index='Sex', columns = 'Pclass', values='Fare')
df_pivot

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [96]:
df_pivot=df.pivot_table(index='Sex', columns = 'Pclass', values='Fare', aggfunc='count')
df_pivot

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

In [97]:
df_pivot2=df.pivot_table(index="Pclass", columns="Sex",values="Survived")
df_pivot2

Sex       female      male
Pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447

In [98]:
df['Underage'] = df['Age'] < 18

In [100]:
df.pivot_table(index='Underage', columns="Sex", values="Survived")

Sex         female      male
Underage
False     0.752896  0.165703
True      0.690909  0.396552

In [103]:
#Date
import datetime
dt = datetime.datetime(2018, 1, 1,10,30)
print(dt)

2018-01-01 10:30:00

In [105]:
ts = pd.Timestamp('2018-01-01 10:30')
ts

Timestamp('2018-01-01 10:30:00')

In [106]:
ts+pd.Timedelta('5 day')

Timestamp('2018-01-06 10:30:00')

In [107]:
pd.to_datetime('2018-01-01 10:30')

Timestamp('2018-01-01 10:30:00')

In [108]:
s=pd.Series(['2018-01-01 10:30', '2018-01-02 10:30', '2018-01-03 10:30'])
s

0    2018-01-01 10:30
1    2018-01-02 10:30
2    2018-01-03 10:30
dtype: object

In [109]:
ts = pd.to_datetime(s)
ts

0   2018-01-01 10:30:00
1   2018-01-02 10:30:00
2   2018-01-03 10:30:00
dtype: datetime64[ns]

In [110]:
ts.dt.day

0    1
1    2
2    3
dtype: int64

In [111]:
pd.Series(pd.date_range('2018-01-01', periods=5, freq='D'))

0   2018-01-01
1   2018-01-02
2   2018-01-03
3   2018-01-04
4   2018-01-05
dtype: datetime64[ns]

In [112]:
df=pd.read_csv('flowdata.csv')

In [115]:
df

                      Time   L06_347  LS06_347  LS06_348
0      2009-01-01 00:00:00  0.137417  0.097500  0.016833
1      2009-01-01 03:00:00  0.131250  0.088833  0.016417
2      2009-01-01 06:00:00  0.113500  0.091250  0.016750
3      2009-01-01 09:00:00  0.135750  0.091500  0.016250
4      2009-01-01 12:00:00  0.140917  0.096167  0.017000
...                    ...       ...       ...       ...
11692  2013-01-01 12:00:00  1.710000  1.710000  0.129583
11693  2013-01-01 15:00:00  1.420000  1.420000  0.096333
11694  2013-01-01 18:00:00  1.178583  1.178583  0.083083
11695  2013-01-01 21:00:00  0.898250  0.898250  0.077167
11696  2013-01-02 00:00:00  0.860000  0.860000  0.075000

[11697 rows x 4 columns]

In [118]:
df['Time']=pd.to_datetime(df['Time'])
df.info()
df=df.set_index('Time')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11697 entries, 0 to 11696
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Time      11697 non-null  datetime64[ns]
 1   L06_347   11696 non-null  float64
 2   LS06_347  11425 non-null  float64
 3   LS06_348  10689 non-null  float64
dtypes: datetime64[ns](1), float64(3)
memory usage: 365.7 KB

In [119]:
df

                      L06_347  LS06_347  LS06_348
Time
2009-01-01 00:00:00  0.137417  0.097500  0.016833
2009-01-01 03:00:00  0.131250  0.088833  0.016417
2009-01-01 06:00:00  0.113500  0.091250  0.016750
2009-01-01 09:00:00  0.135750  0.091500  0.016250
2009-01-01 12:00:00  0.140917  0.096167  0.017000
...                       ...       ...       ...
2013-01-01 12:00:00  1.710000  1.710000  0.129583
2013-01-01 15:00:00  1.420000  1.420000  0.096333
2013-01-01 18:00:00  1.178583  1.178583  0.083083
2013-01-01 21:00:00  0.898250  0.898250  0.077167
2013-01-02 00:00:00  0.860000  0.860000  0.075000

[11697 rows x 3 columns]

In [120]:
df1 = pd.read_csv('flowdata.csv', index_col=0,parse_dates=True)
df1

                      L06_347  LS06_347  LS06_348
Time
2009-01-01 00:00:00  0.137417  0.097500  0.016833
2009-01-01 03:00:00  0.131250  0.088833  0.016417
2009-01-01 06:00:00  0.113500  0.091250  0.016750
2009-01-01 09:00:00  0.135750  0.091500  0.016250
2009-01-01 12:00:00  0.140917  0.096167  0.017000
...                       ...       ...       ...
2013-01-01 12:00:00  1.710000  1.710000  0.129583
2013-01-01 15:00:00  1.420000  1.420000  0.096333
2013-01-01 18:00:00  1.178583  1.178583  0.083083
2013-01-01 21:00:00  0.898250  0.898250  0.077167
2013-01-02 00:00:00  0.860000  0.860000  0.075000

[11697 rows x 3 columns]